# AnalyticalLinkNotConnected Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..AnalyticalLinkNotConnected Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Analytical Link has lost one or more references.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AnalyticalLinkNotConnected { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalLinkNotConnected As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AnalyticalLinkNotConnected {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace